## :x: prd:  tfmigrate plan

[Build link](https://github.com/fumi-mura/tfaction-sample/actions/runs/16574796905)

```
$ tfmigrate plan --out tfplan.binary
```

<details>


```
time=2025-07-28T16:36:48Z level=info msg=download and unarchive the package env=linux/amd64 exe_name=tfmigrate package_name=minamijoyo/tfmigrate package_version=v0.4.2 program=aqua program_version=2.53.3 registry=standard
2025/07/28 16:36:49 [INFO] [runner] unapplied migration files: [tfmigrate.hcl]
2025/07/28 16:36:49 [INFO] [runner] load migration file: state_operation/tfmigrate/tfmigrate.hcl
2025/07/28 16:36:49 [INFO] [migrator] start state migrator plan
2025/07/28 16:36:50 [INFO] [migrator@.] terraform version: 1.12.0
2025/07/28 16:36:50 [INFO] [migrator@.] initialize work dir
2025/07/28 16:36:59 [INFO] [migrator@.] get the current remote state
2025/07/28 16:37:01 [INFO] [migrator@.] override backend to local
2025/07/28 16:37:01 [INFO] [executor@.] create an override file
2025/07/28 16:37:01 [INFO] [migrator@.] creating local workspace folder in: terraform.tfstate.d/default
2025/07/28 16:37:01 [INFO] [executor@.] switch backend to local
2025/07/28 16:37:03 [INFO] [migrator@.] compute a new state
2025/07/28 16:37:04 [INFO] [migrator@.] check diffs
2025/07/28 16:37:08 [ERROR] [migrator@.] unexpected diffs
2025/07/28 16:37:08 [INFO] [executor@.] remove the override file
2025/07/28 16:37:08 [INFO] [executor@.] remove the workspace state folder
2025/07/28 16:37:08 [INFO] [executor@.] switch back to remote
terraform plan command returns unexpected diffs: failed to run command (exited 2): terraform plan -state=/tmp/tmp1026471614 -input=false -no-color -detailed-exitcode -out=tfplan.binary
stdout:

Warning: Deprecated flag: -state

Use the "path" attribute within the "local" backend to specify a file for
state storage
module.init.data.aws_iam_policy_document.assume_role: Reading...
aws_cloudwatch_log_group.foo2: Refreshing state... [id=foo]
module.test_cwlogs1.aws_cloudwatch_log_group.this: Refreshing state... [id=test-cwlogs1]
module.init.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3262162607]
module.init.aws_iam_role.this["prd_apply_admin"]: Refreshing state... [id=prd-iam-role-terraform-apply-admin]
module.init.aws_iam_role.this["prd_plan_admin"]: Refreshing state... [id=prd-iam-role-terraform-plan-readonly]
module.init.aws_iam_role_policy_attachment.this["prd_plan_admin"]: Refreshing state... [id=prd-iam-role-terraform-plan-readonly/arn:aws:iam::aws:policy/ReadOnlyAccess]
module.init.aws_iam_role_policy_attachment.this["prd_apply_admin"]: Refreshing state... [id=prd-iam-role-terraform-apply-admin/arn:aws:iam::aws:policy/AdministratorAccess]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.foo1 will be created
  + resource "aws_cloudwatch_log_group" "foo1" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "foo"
      + name_prefix       = (known after apply)
      + region            = "ap-northeast-1"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "Env"                = "prd"
          + "ManagedByTerraform" = "true"
        }
    }

  # aws_cloudwatch_log_group.foo2 will be destroyed
  # (because aws_cloudwatch_log_group.foo2 is not in configuration)
  - resource "aws_cloudwatch_log_group" "foo2" {
      - arn               = "arn:aws:logs:ap-northeast-1:644370126241:log-group:foo" -> null
      - id                = "foo" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "foo" -> null
      - region            = "ap-northeast-1" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {
          - "Env"                = "prd"
          - "ManagedByTerraform" = "true"
        } -> null
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

stderr:


```


</details>

<!-- github-comment: {"JobName":"tfmigrate-plan","SHA1":"89a0aa4e0c1ca1815ad4df8e319c956c2dd91997","TemplateKey":"tfmigrate-plan","Vars":{},"WorkflowName":"tfmigrate plan"} -->